package ir.topcoders.pol.utils;

public class DamageUtils {

    private static final CharSequence[][] ELEMENTS_DAMAGES = {
            {"انتخاب کنید"},
            {"انتخاب کنید", "شوره زدگی", "خرابی پوشش بتن", "درز و ترک", "نمایان شدن آرماتور ها", "خوردگی آرماتور", "تغییر شکل نامتعارف", "گسیختگی", "آب شستگی"},
            {"انتخاب کنید", "شوره زدگی", "خرابی پوشش بتن", "درز و ترک", "نمایان شدن آرماتور ها", "خوردگی آرماتور", "تغییر شکل نامتعارف", "گسیختگی"},
            {"انتخاب کنید", "زنگ زدگی", "تغییر شکل نامتعارف", "گسیختگی"},
            {"انتخاب کنید", "خرابی بندکشی", "خرابی مصالح", "درز و  ترک", "گسیختگی"},
            {"انتخاب کنید", "شوره زدگی", "خرابی پوشش بتن", "درز و ترک", "نمایان شدن آرماتور ها", "خوردگی آرماتور", "تغییر شکل نامتعارف", "گسیختگی"},
            {"انتخاب کنید", "زنگ زدگی", "تغییر شکل نامتعارف", "گسیختگی"},
            {"انتخاب کنید", "شوره زدگی", "خرابی پوشش بتن", "درز و ترک", "نمایان شدن آرماتور ها", "خوردگی آرماتور", "تغییر شکل نامتعارف", "گسیختگی"},
            {"انتخاب کنید", "زنگ زدگی", "تغییر شکل نامتعارف", "گسیختگی"},
            {"انتخاب کنید", "تغییر شکل نامتعارف", "گسیختگی"},
            {"انتخاب کنید", "زنگ زدگی", "تغییر شکل نامتعارف", "گسیختگی"},
            {"انتخاب کنید", "زنگ زدگی", "گسیختگی"},
            {"انتخاب کنید", "نقص اتصال", "زنگ زدگی", "تغییر شکل نامتعارف", "گسیختگی"},
            {"انتخاب کنید", "شوره زدگی", "خرابی پوشش بتن", "درز و ترک", "نمایان شدن آرماتور ها", "خوردگی آرماتور", "تغییر شکل نامتعارف", "گسیختگی"},
            {"انتخاب کنید", "نشست", "گسیختگی"},
            {"انتخاب کنید", "شوره زدگی", "خرابی پوشش بتن", "درز و ترک", "نمایان شدن آرماتور ها", "خوردگی آرماتور", "تغییر شکل نامتعارف", "گسیختگی"},
            {"انتخاب کنید", "آب شستگی پی", "خرابی بندکشی", "خرابی مصالح", "درز و  ترک", "گسیختگی"},
            {"انتخاب کنید", "تغییر رژیم (نیاز به درایواسیون)", "انسداد"},
            {"انتخاب کنید", "آب شستگی پی", "خرابی قرنیز", "شوره زدگی", "خرابی پوشش بتن", "درز و ترک", "نمایان شدن آرماتور ها", "خوردگی آرماتور", "گسیختگی"},
            {"انتخاب کنید", "خرابی بتن پانل", "گسیختگی"},
            {"انتخاب کنید", "آب شستگی پی", "خرابی مصالح", "خرابی بندکشی", "خرابی قرنیز", "درز و  ترک", "گسیختگی"},
            {"انتخاب کنید", "تغییر شکل نامتعارف", "گسیختگی"},
            {"انتخاب کنید", "فاقد یا خرابی برید"},
            {"انتخاب کنید", "فقدان یا خرابی رادیه"},
            {"انتخاب کنید", "خرابی بتن مجاور", "پرشدن درز", "نشت آب", "اضمحلال/تخریب"},
            {"انتخاب کنید", "خرابی بتن مجاور", "نشت آب", "اضمحلال/تخریب"},
            {"انتخاب کنید", "خرابی آبچکان یا کانال", "انسداد"},
            {"انتخاب کنید", "قیرزدگی", "موج دار شدن", "درز و ترک", "چاله و دست انداز"},
            {"انتخاب کنید", "زنگ زدگی", "تغییر شکل نامتعارف", "اضمحلال/تخریب"},
            {"انتخاب کنید", "شوره زدگی", "خرابی پوشش بتن", "درز و ترک", "اضمحلال/تخریب"},
            {"انتخاب کنید", "عدم وجود", "زنگ زدگی", "نصب غیراساندارد", "نقص اتصال", "تغییر شکل نامتعارف", "گسیختگی"},
            {"انتخاب کنید", "عدم وجود", "خرابی پوشش بتن", "نصب غیراساندارد", "نمایان شدن آرماتور ها", "خوردگی آرماتور", "تغییر شکل نامتعارف", "گسیختگی"},
            {"انتخاب کنید", "خرابی پوشش بتن", "نمایان شدن آرماتور ها", "خوردگی آرماتور"},
            {"انتخاب کنید", "خرابی پوشش بتن", "نمایان شدن آرماتور ها", "خوردگی آرماتور", "گسیختگی"},
            {"انتخاب کنید", "درز و ترک", "تغییر شکل نامتعارف", "گسیختگی", "آب شستگی"}
    };

    private static final CharSequence[] DAMAGES = {
            "انتخاب کنید",
            "شوره زدگی",
            "خرابی پوشش بتن",
            "درز و ترک",
            "نمایان شدن آرماتور ها",
            "خوردگی آرماتور",
            "تغییر شکل نامتعارف",
            "گسیختگی",
            "آب شستگی",
            "زنگ زدگی",
            "خرابی بندکشی",
            "خرابی مصالح",
            "درز و  ترک",
            "نقص اتصال",
            "نشست",
            "آب شستگی پی",
            "تغییر رژیم (نیاز به درایواسیون)",
            "انسداد",
            "خرابی قرنیز",
            "خرابی بتن پانل",
            "فاقد یا خرابی برید",
            "فقدان یا خرابی رادیه",
            "خرابی بتن مجاور",
            "پرشدن درز",
            "نشت آب",
            "اضمحلال/تخریب",
            "خرابی آبچکان یا کانال",
            "قیرزدگی",
            "موج دار شدن",
            "چاله و دست انداز",
            "عدم وجود",
            "نصب غیراساندارد"};

    public static CharSequence[] generateDamageListByElement(int elementIndex) {
        if (elementIndex >= 0 && elementIndex < ELEMENTS_DAMAGES.length)
            return ELEMENTS_DAMAGES[elementIndex];
        return null;
    }

    public static int getDamageLocalIndex(int elementIndex, int damageIndex) {
        CharSequence[] damagesByElement = generateDamageListByElement(elementIndex);
        CharSequence damageName = DAMAGES[damageIndex];
        if (damagesByElement != null && damagesByElement.length > 0)
            for (int index = 0; index < damagesByElement.length; index++)
                if (damagesByElement[index].toString().equalsIgnoreCase(damageName.toString()))
                    return index;
        return 0;
    }

    public static int getDamageIndexByName(CharSequence damageName) {
        for (int index = 0; index < DAMAGES.length; index++)
            if (DAMAGES[index].toString().equalsIgnoreCase(damageName.toString()))
                return index;
        return 0;
    }

    public static String getDamageNameByIndex(int index) {
        if (index < DAMAGES.length)
            return DAMAGES[index].toString();
        return "";
    }
}
